

Процедура ОбработкаПроведения(Отказ, Режим)

	
	// регистр ОстаткиМатериалов Расход
	Движения.ОстаткиМатериалов.Записывать = Истина;
	Движения.СтоимостьМатериалов.Записывать = Истина;
	Движения.Продажи.Записывать = Истина;
    	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОказаниеУслугиПереченьНоменклатуры.Номенклатура КАК Номенклатура,
		|	СУММА(ОказаниеУслугиПереченьНоменклатуры.Количество) КАК КоличествоВДокументе,
		|	СУММА(ОказаниеУслугиПереченьНоменклатуры.Сумма) КАК СуммаВДокументе,
		|	МАКСИМУМ(ОказаниеУслугиПереченьНоменклатуры.Стоимость) КАК Стоимость,
		|	ОказаниеУслугиПереченьНоменклатуры.Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры
		|ИЗ
		|	Документ.ОказаниеУслуги.ПереченьНоменклатуры КАК ОказаниеУслугиПереченьНоменклатуры
		|ГДЕ
		|	ОказаниеУслугиПереченьНоменклатуры.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ОказаниеУслугиПереченьНоменклатуры.Номенклатура,
		|	ОказаниеУслугиПереченьНоменклатуры.Номенклатура.ВидНоменклатуры";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.ВидНоменклатуры = 
			Перечисления.ВидыНоменклатуры.Материал Тогда
			// Регистр ОстаткиМатериалов Расход 
			Движение = Движения.ОстаткиМатериалов.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата; 
			Движение.Материал = ВыборкаДетальныеЗаписи.Номенклатура;
			Движение.Склад = Склад; 
			Движение.Количество = ВыборкаДетальныеЗаписи.КоличествоВДокументе;
			// Регистр СтоимостьМатериалов Расход 
			Движение = Движения.СтоимостьМатериалов.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата; 
			Движение.Материал = ВыборкаДетальныеЗаписи.Номенклатура;
			Движение.Стоимость = ВыборкаДетальныеЗаписи.КоличествоВДокументе *  
			ВыборкаДетальныеЗаписи.Стоимость; 
		КонецЕсли; 
		       // Регистр Продажи
			   Движение = Движения.Продажи.Добавить();
			   Движение.Период = Дата;
			   Движение.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
			   Движение.Клиент = Клиент; Движение.Мастер = Мастер;
			   Движение.Количество = ВыборкаДетальныеЗаписи.КоличествоВДокументе;
			   Движение.Выручка = ВыборкаДетальныеЗаписи.СуммаВДокументе;
			   Движение.Стоимость = ВыборкаДетальныеЗаписи.Стоимость *     
			   					ВыборкаДетальныеЗаписи.КоличествоВДокументе;
			КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	Для Каждого ТекСтрокаПереченьНоменклатуры Из ПереченьНоменклатуры Цикл
		Если ТекСтрокаПереченьНоменклатуры.Номенклатура.ВидНоменклатуры =      
			Перечисления.ВидыНоменклатуры.Материал Тогда 
		Движение = Движения.ОстаткиМатериалов.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Материал = ТекСтрокаПереченьНоменклатуры.Номенклатура;
		Движение.Склад = Склад;
		Движение.Количество = ТекСтрокаПереченьНоменклатуры.Количество;
			
		// регистр СтоимостьМатериалов Расход 
		Движение = Движения.СтоимостьМатериалов.Добавить(); 
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход; 
		Движение.Период = Дата; 
		Движение.Материал = ТекСтрокаПереченьНоменклатуры.Номенклатура;
		Движение.Стоимость = ТекСтрокаПереченьНоменклатуры.Количество *       
		ТекСтрокаПереченьНоменклатуры.Стоимость; 
		
	КонецЕсли; 
	
	// Регистр Продажи 
	Движение = Движения.Продажи.Добавить();
	Движение.Период = Дата; 
	Движение.Номенклатура = ТекСтрокаПереченьНоменклатуры.Номенклатура; 
	Движение.Клиент = Клиент; 
	Движение.Мастер = Мастер; Движение.Количество = ТекСтрокаПереченьНоменклатуры.Количество;
	Движение.Выручка = ТекСтрокаПереченьНоменклатуры.Сумма;
	Движение.Стоимость = ТекСтрокаПереченьНоменклатуры.Стоимость *        ТекСтрокаПереченьНоменклатуры.Количество;
	
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
